; domain
;; domain_1.pddl for bimanual manipulation
;; This domain is for the pouring goal exclusively

(define (domain domain_pour)
  (:requirements :strips)

  (:types graspable - object
               hand - object
           location - object
  )

  (:predicates 
  	(at ?hand - hand ?obj - graspable)
    (enclosed ?hand - hand ?obj - graspable)
    (poured ?fromObj - graspable ?fromLoc - location ?toObj - graspable ?toLoc - location)
  )

  (:action approach
           :parameters (?hand - hand ?obj - graspable)
           :precondition (and (not (at ?hand ?obj)))
           :effect (and (at ?hand ?obj))
   )

   (:action enclose
           :parameters (?hand - hand ?obj - graspable)
           :precondition (and (at ?hand ?obj) (not (enclosed ?hand ?obj)))
           :effect (and (enclosed ?hand ?obj))
   )

   (:action pour
           :parameters (?hand1 ?hand2 - hand ?fromObj - graspable ?fromLoc - location ?toObj - graspable ?toLoc - location)
           :precondition (and (at ?hand1 ?toObj) (enclosed ?hand1 ?fromObj) (enclosed ?hand2 ?toObj) (not (enclosed ?hand1 ?toObj)) (not (enclosed ?hand2 ?fromObj)))
           :effect (and (poured ?fromObj ?fromLoc ?toObj ?toLoc))
   )
)

; problem
;; problem file: task_Exp4_pour.pddl
;; This problem file is to run Fast Downward for the "pour" task. It is for Experiment 4.

(define (problem bimanual-probPour)
  (:domain domain_pour)
(:objects mug sugar_box pitcher_base bowl tuna_fish_can tomato_soup_can pudding_box mustard_bottle gelatin_box cracker_box initial_location_handleft initial_location_handright - graspable 
            handright handleft - hand
            1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 - location 
)

  (:init 
  	(at handleft initial_location_handleft)
    (at handright initial_location_handright)
  )
 (:goal (and (poured gelatin_box 9 bowl 4))))

; plan
1. (approach handright gelatin_box)
   added: (at handright gelatin_box)
   goals met: 0 of 1
2. (enclose handright gelatin_box)
   added: (enclosed handright gelatin_box)
   goals met: 0 of 1
3. (approach handright bowl)
   added: (at handright bowl)
   goals met: 0 of 1
4. (approach handleft bowl)
   added: (at handleft bowl)
   goals met: 0 of 1
5. (enclose handleft bowl)
   added: (enclosed handleft bowl)
   goals met: 0 of 1
6. (pour handright handleft gelatin_box 9 bowl 4)
   added: (poured gelatin_box 9 bowl 4)
   goals met: 1 of 1
